---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarHookLengthOverride
source: html/dca57221-15fd-1bae-0587-1fed909971a8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarHookLengthOverride Property

"Override Hook Lengths"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarHookLengthOverride { get; }
```